Revit 2024 API
CeramicPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicPattern" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum CeramicPatternType
Visual Basic
Public Enumeration CeramicPatternType
Visual C++
public enum class CeramicPatternType
Members
Member name | Description
None
Custom
See Also
Autodesk.Revit.DB.Visual Namespace